%%%%% CASTLE IN THE SKY  天空之城
clear;clc;close all;
%%%%%%%%标准音A4
A4=440;
%%%%%%%频率
pt=8192;
p0=pt/1;
%%%%%%%十二平均律
scale1=A4/2^(9/12)*2.^((0:11)/12-1);%低音
scale2=A4/2^(9/12)*2.^((0:11)/12);%中音
scale3=A4/2^(9/12)*2.^((0:11)/12+1);%高音
scale4=A4/2^(9/12)*2.^((0:11)/12+2);
map=[1 3 5 6 8 10 12];%七音符
%%%%%%%音调
scale=zeros(50,1);
for i=1:4  %low mid high
    for j=1:7   %do re mi fa so la ti
        k=i*10+j;
        if i==1
            scale(k)=scale1(map(j));
        elseif i==2
            scale(k)=scale2(map(j));
        elseif i==3
            scale(k)=scale3(map(j));
        elseif i==4
            scale(k)=scale4(map(j));
        end
    end
end
%%%%%%%高音
score1=30+[0 0 0 6 7  11 7 11 13  7 3 5  6 5 6 11 5 2 3,...
    4 3 4 11 3 11 12  7 6 6 7 11 7 0 6 7  11 7 11 13 7 3 5,...
    6 5 6 11 5 2 3   4 3 4 11 11 11 12,...
    7 6 5 6 0 11 12  13 12 13 15 12 15,...
    14 13 13 12 13 6 7   11 7 11 13 15 12 11 12,...
    14 14 13 12 13 11 12    13 12 13 15 12 5,...
    16 15 15 14 15 13 6 7    11 7 11 13 15 12 12 13 12,...
    11 12 11 7 6 5 6,...
    ];
%%%%%%%节拍
rhythm1=[1 1 1.5 0.25 0.25  0.75 0.25 0.5 0.5 1.5 0.25 0.25  0.75 0.25 0.25 0.75 1.5 0.25 0.25,...
    0.75 0.25 0.25 0.75 1.5 0.25 0.25   0.75 0.25 0.25 0.5 0.25 1 0.5 0.25 0.25  0.75 0.25 0.5 0.5 1.5 0.25 0.25,...
    0.75 0.25 0.25 0.75 1.5 0.25 0.25   0.75 0.25 0.25 0.75 1.5 0.25 0.25,...
    0.75 0.75 0.5 1 0.5 0.25 0.25    0.75 0.25 0.25 0.75 1.5 0.5,...
    0.75 0.25 0.5 0.25 1.75 0.25 0.25    0.75 0.25 0.5 0.5 0.75 0.75 0.25 0.25,...
    0.75 0.25 0.25 0.75 1.5 0.25 0.25   0.75 0.25 0.25 0.75 1.5 0.25 0.25,...
    0.75 0.25 0.25 0.5 0.25 1.5 0.25 0.25   0.75 0.25 0.5 0.5 0.75 0.25 0.5 0.25 0.25,...
    0.75 0.25 0.25 0.5 0.25 2,...
    ];
%%%%%%%低音
score2=10+[10 10 10 10  6 13 16 5 13 15 4 11 14 3 17 13,...
    2 6 12 1 5 11 2 7 12 3 7 13 15 6 13 16 13 5 13 15 13,...
    4 11 14 11 3 7 13 7 2 6 12 6 1 5 11 5,...
    2 7 12 14 3 11 13 15 6 13 16 21 6 16 5 15 11 15 21 23 25 23 21 15 5 12 15 17 22 17 15 12,...
    4 11 14 16 21 16 14 11 3 7 13 15 17 22 23 25 6 13 16 21 23 21 16 13 5 12 15 17 22 17 15 12,...
    4 11 14 16 21 16 14 11 3 13 15 17 6 16 5 15 11 15 21 23 25 23 21 15 5 12 15 17 22 17 15 12,...
    4 11 14 16 21 16 14 11 3 7 13 15 17 15 13 7  6 13 16 21 23 21 16 13 5 12 15 17 22 17 15 12,...
    4 11 14 16 3 7 13 15 6 13 16 21 6 16 17,...
    ];
%%%%%%%节拍
rhythm2=[1 1 1 1  0.5 0.5 1 0.5 0.5 1  0.5 0.5 1 0.5 0.5 1,...
    0.5 0.5 1 0.5 0.5 1  0.5 0.5 1 0.5 0.5 0.5 0.5  0.5 0.5 0.5 0.5 0.5 0.5 0.5 0.5,...
    0.5 0.5 0.5 0.5 0.5 0.5 0.5 0.5   0.5 0.5 0.5 0.5 0.5 0.5 0.5 0.5,...
    0.25*ones(1,32)  0.25*ones(1,32) 0.25*ones(1,32) 0.25*ones(1,32),...
    0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.25 0.5 0.25 0.25
    ];
% %%%%%%%%%short for test
% %%%%%%%高音
% score1=30+[0 0 0 6 7  11 7 11 13  7 3 5  6 5 6 11 5 2 3];
% %%%%%%%节拍
% rhythm1=[1 1 1.5 0.25 0.25  0.75 0.25 0.5 0.5 1.5 0.25 0.25  0.75 0.25 0.25 0.75 1.5 0.25 0.25];
% %%%%%%%低音
% score2=10+[10 10 10 10  6 13 16 5 13 15 4 11 14 3 17 13];
% %%%%%%%节拍
% rhythm2=[1 1 1 1  0.5 0.5 1 0.5 0.5 1  0.5 0.5 1 0.5 0.5 1];

%%%%%%play
s1=zeros((sum(rhythm1)+4)*p0,1);
s2=zeros((sum(rhythm2)+4)*p0,1);
state=1;
switch state
    case 1       
        %%%%%%%% Piano
        d=3; %泛音衰减倍数
        Nd=8; %泛音个数
        a=1.4; %包络Beta分布参数
        b=3; %包络Beta分布参数
        %高音
        for i=1:length(score1)
            temp1=sin((1:2*rhythm1(i)*p0)'/pt*2*pi*scale(score1(i))*(1:Nd))./(ones(length(1:2*rhythm1(i)*p0),1)*d.^(1:Nd));%泛音
            temp=sum(temp1,2).*betapdf((1/2/rhythm1(i):1/2/rhythm1(i):p0)'/p0,a-(score1(i)-30)/100,b+(score1(i)-30)/20);
            index=sum(rhythm1(1:(i-1)));
            s1((1+p0*index):(p0*index+length(temp)))=s1((1+p0*index):(p0*index+length(temp)))+temp;
        end
        %低音
        for i=1:length(score2)
            temp1=sin((1:2*rhythm2(i)*p0)'/pt*2*pi*scale(score2(i))*(1:Nd))./(ones(length(1:2*rhythm2(i)*p0),1)*d.^(1:Nd));
            temp=sum(temp1,2).*betapdf((1/2/rhythm2(i):1/2/rhythm2(i):p0)'/p0,a-(score2(i)-10)/100,b+(score2(i)-10)/20);
            index=sum(rhythm2(1:(i-1)));
            s2((1+p0*index):(p0*index+length(temp)))=s2((1+p0*index):(p0*index+length(temp)))+temp;
        end       

    case 2       
        %%%%%%%%%% Violin
        %高音
        d=2^0.3; %泛音衰减倍数
        Nd=10; %泛音个数
        a=1.5; %包络Beta分布参数
        b=1.5; %包络Beta分布参数
        for i=1:length(score1)
            temp1=sin((1:1.2*rhythm1(i)*p0)'/pt*2*pi*scale(score1(i))*(1:Nd))./(ones(length(1:1.2*rhythm1(i)*p0),1)*d.^(1:Nd));%泛音
            temp1(:,2:Nd)=1/2*temp1(:,2:Nd);
            temp=sum(temp1,2).*betapdf((1/1.2/rhythm1(i):1/1.2/rhythm1(i):p0)'/p0,a-(score1(i)-30)/200,b+(score1(i)-30)/200).*...
                (1+1/8*sin((1/1.2/rhythm1(i):1/1.2/rhythm1(i):p0)'/p0*2*pi*2*exp(-(score1(i)-100)/100))).*...
                (1+1/16*sin((1/1.2/rhythm1(i):1/1.2/rhythm1(i):p0)'/p0*2*pi*2*2*exp(-(score1(i)-100)/100))).*(1+1/8*randn(1));
            index=sum(rhythm1(1:(i-1)));
            s1((1+p0*index):(p0*index+length(temp)))=s1((1+p0*index):(p0*index+length(temp)))+temp;
        end
        %低音 Piano 配音
        d=3; %泛音衰减倍数
        Nd=8; %泛音个数
        a=1.4; %包络Beta分布参数
        b=3; %包络Beta分布参数
        for i=1:length(score2)
            temp1=sin((1:2*rhythm2(i)*p0)'/pt*2*pi*scale(score2(i))*(1:Nd))./(ones(length(1:2*rhythm2(i)*p0),1)*d.^(1:Nd));
            temp=sum(temp1,2).*betapdf((1/2/rhythm2(i):1/2/rhythm2(i):p0)'/p0,a-(score2(i)-10)/100,b+(score2(i)-10)/20);
            index=sum(rhythm2(1:(i-1)));
            s2((1+p0*index):(p0*index+length(temp)))=s2((1+p0*index):(p0*index+length(temp)))+temp;
        end      
end
s1=0.95*s1/max(abs(s1));
s2=0.95*s2/max(abs(s2));
% figure;
% subplot(2,1,1)
% plot(s1)
% title('高音')
% subplot(2,1,2)
% plot(s2)
% title('低音')
sound([s1 s2],pt);
